In [51]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [52]:
df=pd.read_csv('vgsales.csv')
df

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [53]:
df['Name'].value_counts()

Need for Speed: Most Wanted                12
Ratatouille                                 9
FIFA 14                                     9
LEGO Marvel Super Heroes                    9
Madden NFL 07                               9
                                           ..
Ar tonelico Qoga: Knell of Ar Ciel          1
Galaga: Destination Earth                   1
Nintendo Presents: Crossword Collection     1
TrackMania: Build to Race                   1
Know How 2                                  1
Name: Name, Length: 11493, dtype: int64

In [54]:
df['Platform'].value_counts()

DS      2163
PS2     2161
PS3     1329
Wii     1325
X360    1265
PSP     1213
PS      1196
PC       960
XB       824
GBA      822
GC       556
3DS      509
PSV      413
PS4      336
N64      319
SNES     239
XOne     213
SAT      173
WiiU     143
2600     133
NES       98
GB        98
DC        52
GEN       27
NG        12
SCD        6
WS         6
3DO        3
TG16       2
GG         1
PCFX       1
Name: Platform, dtype: int64

In [55]:
df['Genre'].value_counts()

Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Adventure       1286
Racing          1249
Platform         886
Simulation       867
Fighting         848
Strategy         681
Puzzle           582
Name: Genre, dtype: int64

In [56]:
df['Publisher'].value_counts()

Electronic Arts                 1351
Activision                       975
Namco Bandai Games               932
Ubisoft                          921
Konami Digital Entertainment     832
                                ...
Warp                               1
New                                1
Elite                              1
Evolution Games                    1
UIG Entertainment                  1
Name: Publisher, Length: 578, dtype: int64

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB

In [58]:
df.shape

(16598, 11)

In [59]:
df.size

182578

In [60]:
df.describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16598.000000,16327.000000,16598.000000,16598.000000,16598.000000,16598.000000,16598.000000
mean,8300.605254,2006.406443,0.264667,0.146652,0.077782,0.048063,0.537441
std,4791.853933,5.828981,0.816683,0.505351,0.309291,0.188588,1.555028
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4151.250000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8300.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12449.750000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.470000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [61]:
df.replace({'Genre':{'Action':1,'Sports':2,'Misc':3,'Role-Playing':4,
            'Shooter':5,'Adventure':6,'Racing':7,'Platform':8,
            'Simulation':9,'Fighting':10,'Strategy':11,'Puzzle':12 }}, inplace=True)

In [62]:
df.isnull().sum()

Rank              0
Name              0
Platform          0
Year            271
Genre             0
Publisher        58
NA_Sales          0
EU_Sales          0
JP_Sales          0
Other_Sales       0
Global_Sales      0
dtype: int64

In [63]:
x=df.drop(['Year','Publisher','Global_Sales','Name','Platform'],axis=1)
y=df['Global_Sales']

In [64]:
y

0        82.74
1        40.24
2        35.82
3        33.00
4        31.37
         ...
16593     0.01
16594     0.01
16595     0.01
16596     0.01
16597     0.01
Name: Global_Sales, Length: 16598, dtype: float64

In [65]:
x

        Rank  Genre  NA_Sales  EU_Sales  JP_Sales  Other_Sales
0          1      2     41.49     29.02      3.77         8.46
1          2      8     29.08      3.58      6.81         0.77
2          3      7     15.85     12.88      3.79         3.31
3          4      2     15.75     11.01      3.28         2.96
4          5      4     11.27      8.89     10.22         1.00
...      ...    ...       ...       ...       ...          ...
16593  16596      8      0.01      0.00      0.00         0.00
16594  16597      5      0.01      0.00      0.00         0.00
16595  16598      7      0.00      0.00      0.00         0.00
16596  16599     12      0.00      0.01      0.00         0.00
16597  16600      8      0.01      0.00      0.00         0.00

[16598 rows x 6 columns]

In [66]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn import metrics

In [67]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=420)

In [68]:
x_test

        Rank  Genre  NA_Sales  EU_Sales  JP_Sales  Other_Sales
8869    8871      1      0.08      0.06      0.00         0.01
15262  15265      6      0.00      0.00      0.02         0.00
4808    4810      1      0.20      0.15      0.00         0.05
13069  13071      3      0.05      0.00      0.00         0.00
13425  13427      3      0.00      0.00      0.05         0.00
...      ...    ...       ...       ...       ...          ...
10799  10801      1      0.08      0.01      0.00         0.01
14137  14139      5      0.02      0.01      0.00         0.00
10117  10119      2      0.09      0.02      0.00         0.01
15243  15246      6      0.00      0.00      0.02         0.00
14918  14921     12      0.00      0.02      0.00         0.00

[3320 rows x 6 columns]

In [69]:
lr=LinearRegression()
lr

LinearRegression()

In [70]:
lr.fit(x_train,y_train)

LinearRegression()

In [71]:
train_pred=lr.predict(x_train)
test_pred=lr.predict(x_test)

In [72]:
test_pred

array([0.1503784 , 0.02081034, 0.40006857, ..., 0.12046205, 0.0208089 ,
       0.02071876])

In [73]:
train_pred

array([0.08048034, 0.10042289, 0.09049851, ..., 1.53981773, 0.03076552,
       0.09055332])

In [74]:
error_train = metrics.r2_score(y_train, train_pred)
error_train

0.9999891983813636

In [75]:
error_test = metrics.r2_score(y_test, test_pred)
error_test

0.9999868165457393